[
	{
		"$comment": "blog title exceeds 150 char limit",
        "id": 384063045728,
		"title": "One Drop Increases Accuracy of AI-powered Hypoglycemia and Hyperglycemia Predictions and Introduces Alert Capability for People Using Continuous Glucose Monitors",
		"created_at": "2020-02-25T12:51:59-05:00",
		"body_html": "<p><em>The results of a recent study show that One Drop’s AI-powered glucose predictions are 91.9% accurate for hypoglycemia (\"low\") and 91.6% accurate for hyperglycemia (\"high\"), demonstrating greater accuracy than other notable providers.</em></p>\n<p><strong>NEW YORK, NY, February 25, 2020 —</strong> One Drop, a leader in digital therapeutics solutions for people living with diabetes and other chronic conditions, presented new results for continuous glucose monitor-based glucose predictions at <a href=\"https://attd.kenes.com/\" target=\"_blank\" rel=\"noopener noreferrer\">The 13th International Conference on Advanced Technologies &amp; Treatments for Diabetes</a> in Madrid, Spain. These findings demonstrate increased accuracy of direct glucose, hypoglycemia, and hyperglycemia predictions across multiple time periods.</p>\n<p>One Drop’s patent-pending machine learning model accurately predicts the probabilities that a user’s glucose will rise above 180 mg/dL or fall below 70 mg/dL. At 30 minutes, the predictions are 99.5% accurate, at 1 hour, 98.6% accurate, and at 4 hours, One Drop’s accuracy is 91.9%, which is higher than other published studies examining hypoglycemia prediction using continuous glucose monitor (CGM) data [1]. Sources for One Drop’s study included over 10 million hours of CGM data as well as self­-care data from a sample of over 3,000 users. </p>\n<p>“One Drop’s breadth of data includes glucose, food, exercise, sleep, and heart rate, which allows us to surpass the accuracy of IBM Watson Health at four-hour hypoglycemia predictions,” said One Drop VP of Data Science, Dan Goldner. “For the first time, we have the capability to alert people at risk of experiencing severely high or low blood sugar. Our AI-powered alerts have the po­tential to help our millions of users worldwide exercise proactive, preventative self-care.”</p>\n<p>The study results also indicate an increased level of accuracy for point predictions of blood glucose concentration at 30 minutes and one hour, as compared to a previous study submitted to the <a href=\"https://www.diabetestechnology.org/dtm/submitted-abstracts.shtml\" target=\"_blank\" rel=\"noopener noreferrer\">Diabetes Technology Society</a> [2]. The most substantial change occurred in the percentage of predictions with errors less than 30 mg/dL, which rose from 97.0% to 98.9% in 30-minute predictions and from 77.9% to 78.7% in one-hour predictions.</p>\n<p>“As someone living with type 1 diabetes, I know how scary going low can be. It can literally be a matter of life or death,” said One Drop founder and CEO, Jeff Dachis. “Our increasingly accurate machine learning models take the fear and guesswork out of managing low blood sugar and prevent harmful overcorrections that often lead to hyperglycemia and increased A1C.”</p>\n<p>One Drop provides users with <a href=\"https://onedrop.today/blogs/press-releases/one-drop-announces-blood-glucose-prediction-automated-decision-support\" target=\"_blank\" rel=\"noopener noreferrer\">AI-powered Predictive Insights</a> and real-time advice on how to adjust their behavior (diet, physical activity, and more) for better outcomes without intervention from a health care provider. The machine learning models are trained on more than eight billion data points from three million users worldwide. Importantly, One Drop's models do not require getting to know an individual over time. Unlike other predictive tools, One Drop's models provide accurate predictions for one person based on the aggregate data of all people with similar health profiles. Within minutes of entering a single data point into the One Drop app, a user can receive their first prediction.</p>\n<p>One Drop offers personalized programs for people living with diabetes, prediabetes, high blood pressure, high cholesterol, or any combination of these conditions. The company’s unique approach to inspiring positive behavior change and proactive self-care combines personal health coaching, connected devices, and life-saving predictions.<br><br></p>\n<ol>\n<li>Agarwal P. et al. Machine Learning to Predict Hypoglycemic Events from Continuous Glucose Monitoring Data. Diabetes 2019;68(Supplement 1).</li>\n<li>Wexler Y. Blood Glucose Prediction from Pooled Continuous Glucose Monitor Data. J Diabetes Sci Technol. In press. </li>\n</ol>\n<p> </p>\n<p> </p>",
		"blog_id": 28891840608,
		"author": "Andrea Lagotte",
		"user_id": 106181264,
		"published_at": "2020-02-25T13:31:00-05:00",
		"updated_at": "2020-02-25T13:48:47-05:00",
		"summary_html": "",
		"template_suffix": "press-release",
		"handle": "hypoglycemia-hyperglycemia-alerts-accurate-ai-predictions-cgm",
		"tags": "",
		"admin_graphql_api_id": "gid://shopify/Article/384063045728",
		"image": {
			"created_at": "2020-02-25T13:30:02-05:00",
			"alt": "",
			"width": 1440,
			"height": 756,
			"src": "https://cdn.shopify.com/s/files/1/1488/7742/articles/cgm-forecast-feature_327c4e65-b919-4a56-af00-304ab7ee1faf.jpg?v=1582655402"
		}
	},
	{
		"$comment": "blog title exceeds 150 char limit",
		"id": 383997313120,
		"title": "One Drop Expands Team to Include Former Sanofi Head of US Diabetes Integrated Care, Rachel Y. Martens, and Behavioral Science Expert, Dr. Gina Merchant",
		"created_at": "2020-02-13T10:21:51-05:00",
		"body_html": "<em>Rachel Yap Martens joins as Senior Vice President of Consumer Solutions and Commercial Strategy; Gina Merchant, Ph.D. joins as Vice President of Behavioral Design and Science</em> <br><br> <strong>NEW YORK, NY, February 12, 2020 —</strong> One Drop, a leader in digital therapeutics solutions for people living with diabetes and other chronic conditions, today announced the additions of Rachel Yap Martens, former Head of US Diabetes Integrated Care at Sanofi, and Dr. Gina Merchant, former Senior Behavioral Scientist at ResMed. <br><br> Rachel Yap Martens joins One Drop’s commercial leadership team as Senior Vice President of Consumer Solutions and Commercial Strategy. Together with Rachel Sánchez-Madhur, Senior Vice President of Product, and Brian Kemper, Senior Vice President of Enterprise Solutions, Martens will drive the growth of One Drop’s consumer user base, thereby bringing improved outcomes and quality of life to individuals with diabetes and other chronic conditions. <br><br> Dr. Gina Merchant joins One Drop as Vice President of Behavioral Design and Science. She brings years of experience designing digital solutions to help patients manage their chronic conditions using evidence-based behavioral interventions. At One Drop, Merchant will incorporate behavioral science into the core user experience and bring data-driven behavioral interventions to One Drop’s multi-condition offering. She will also work on evidence generation. <br><br> “Martens’ and Merchant’s respective expertise and perspectives will be critical as we continue to provide individuals with the tools and support they need to enable effective self-care outside the doctor’s office,” said Jeff Dachis, One Drop Founder and CEO. “These additions to our team will enable One Drop to capitalize on what we predict to be a huge shift towards consumer-led healthcare in 2020.” <br><br> One Drop offers personalized programs for people living with diabetes, prediabetes, high blood pressure, high cholesterol, or any combination of these conditions. The company’s unique approach combines personal health coaching with AI-powered insights to deliver affordable, effective care to the greatest number of people possible. <br><br> One Drop uses proprietary machine learning algorithms, powered by six billion longitudinal health data points contributed by One Drop users, to generate accurate health predictions. These predictions are coupled with actionable behavioral advice and delivered in the <a href=\"https://onedrop.today/pages/mobile-app\">One Drop app</a> to simplify decision making and promote lasting behavior change. In 2019, One Drop expanded its <a href=\"https://onedrop.today/blogs/press-releases/one-drop-announces-blood-glucose-prediction-automated-decision-support\" target=\"_blank\" title=\"AI, machine learning, predictive insights, artificial intelligence, predictions, diabetes\" rel=\"noopener noreferrer\">AI-powered Predictive Insights</a> by launching <a href=\"https://onedrop.today/blogs/press-releases/one-drop-launches-8-hour-blood-glucose-forecasts-for-people-with-type-2-diabetes-on-insulin\" title=\"AI, machine learning, predictive insights, artificial intelligence, predictions, diabetes\">8-hour blood glucose forecasts</a>, and in doing so became the first and only provider of blood glucose forecasts for people with type 2 diabetes. One Drop will bring forecasts to people living with other chronic conditions in 2020.",
		"blog_id": 28891840608,
		"author": "Andrea Lagotte",
		"user_id": 106181264,
		"published_at": "2020-02-12T12:00:00-05:00",
		"updated_at": "2021-03-12T11:34:27-05:00",
		"summary_html": "",
		"template_suffix": "press-release",
		"handle": "one-drop-expands-team",
		"tags": "",
		"admin_graphql_api_id": "gid://shopify/Article/383997313120",
		"image": {
			"created_at": "2021-02-22T11:27:56-05:00",
			"alt": "",
			"width": 2880,
			"height": 1512,
			"src": "https://cdn.shopify.com/s/files/1/1488/7742/articles/CFO_feature-image_ec814223-9770-4550-a6ce-fbdc54015c32.jpg?v=1614011277"
		}
	},
	{
		"$comment": "blog title exceeds 150 char limit",
		"id": 28912025696,
		"title": "One Drop Announces Partnership with the National Health Insurance Company - Daman, The UAE’s Leading Specialized Health Insurer, and Implementation of the One Drop",
		"created_at": "2018-12-18T13:04:00-05:00",
		"body_html": "<i>Company announces partnership with The National Health Insurance Company – Daman, the UAE's leading specialized health insurer, making comprehensive diabetes care available to more than 3 million members in the UAE via the One Drop | Professional enterprise platform.</i>\r\n\r\n \r\n\r\n<b><i>December 15, 2016 — New York — </i></b>One Drop today announced that The National Health Insurance Company – Daman (“Daman”), the UAE's largest and most innovative health insurer, has chosen One Drop to lead its digital and mobile health innovation efforts in diabetes.\r\n\r\nOne Drop's enterprise solution, One Drop | Professional, has been implemented by Daman to empower its members living with diabetes to monitor and take charge of their health through easy-to-use, accessible technology. One Drop | Professional is a population health management platform that fosters real-time interactions between people with diabetes and their healthcare teams. With One Drop | Professional, members track their health data and receive personalized health coaching through the One Drop | Mobile platform. Care providers are able to view members' health data in real-time and provide relevant, highly personalized education and support in the context of everyday life, which is when these interactions are needed most.\r\n\r\n“We are committed to using the most innovative technology to expand quality and effectiveness of care, and through our partnership with One Drop we expect to make great strides in diabetes management and outcomes,” said Dr. Michael Bitzer, Chief Executive Officer at Daman. “One Drop's platform offers a way to fill the gap between clinic visits, allowing for the continuity of care necessary for people with diabetes to get and stay healthy.”\r\n\r\nOne Drop | Professional has been adapted for Daman based on a thorough understanding of the social habits, lifestyles and culture of the people of the UAE. The One Drop | Mobile experience has been enhanced to include special features for Daman members, including Arabic language support, region-specific food data, a 9-week lesson plan, and curated content via the in-app news feed. Daman members also have access to premium features that allow them to communicate with Daman health coaches to get the information and support needed for improved blood glucose management.\r\n\r\nOver the past few decades, rapid economic growth across the Middle East has led to a rapid change of lifestyle and a corresponding increase in the<b> </b>rates of diabetes in the region. Today, the Middle East and North Africa (MENA) have the highest prevalence of diabetes in the world, with nearly 35 million people (1 in every 10) diagnosed. According to the <a href=\"http://data.worldbank.org/indicator/SH.STA.DIAB.ZS?order=wbapi_data_value_2015+wbapi_data_value+wbapi_data_value-first&amp;sort=desc\">International Diabetes Federation</a>, 19.3 percent of adults ages 20 to 79 in the United Arab Emirates have diabetes, and it is among of the leading causes of premature death. Spending on diabetes care in the MENA region is estimated to rise from $16.8 billion in 2014 to $24.7 billion in 2035, threatening to impact economics and bankrupt healthcare systems.\r\n\r\nGovernments and healthcare providers have recognized the severity of epidemic and, beginning in 2009, the UAE government rolled out a ten-year plan to fight the disease including increased diabetes research, public awareness campaigns, and updated medical facilities. Daman is taking an innovative approach by using mobile technology to move care beyond the clinic and into people's everyday lives. One Drop | Professional combines the use of real-time data and human support to empower people to take ownership of their diabetes management in a way that is motivating, encouraging, and long-lasting. Daman members are able to see the relationship between their behaviors and blood sugars each day and, with the continuous support of their coach, effect positive behavioral change and avoid long-term complications.\r\n\r\n“Daman is an ideal partner for implementing One Drop | Professional, given its focus on providing members with smart choices and the highest possible level of support, comfort and convenience when it comes to healthcare.” said Jeff Dachis, Founder and Chief Executive Officer of One Drop. “The UAE is among the countries facing the highest diabetes rates in the world. Our collective goal is to provide affordable, accessible, and effective evidence-based care to improve outcomes for the people who need it most.”\r\n\r\n<b>About The National Health Insurance Company – Daman</b>\r\nThe National Health Insurance Company – Daman is the UAE's leading specialized health insurer, providing comprehensive health insurance solutions to more than 3 million members in the UAE. Over the years, the company has been the partner of choice for a number of the country’s most prominent organizations and multinational companies in various industries including oil and gas, aerospace, energy, construction, investments and media.\r\n\r\nDaman is a public joint-stock company that is 80% owned by the Abu Dhabi Government with the remaining 20% owned by Munich Re. The company is backed by the reliable support of the Abu Dhabi Government and its strategic partner, Munich Re, one of the world’s leading reinsurers, plays an important role as both reinsurer and a valuable source for knowledge transfer.\r\n\r\nHeadquartered in Abu Dhabi and established in 2006, Daman offers a range of health insurance plans for both individuals and organizations and exclusively manages the Government’s health program, Thiqa, for UAE Nationals and Abu Dhabi Basic Plan for low income expatriates. Members enjoy access to the largest healthcare providers’ network in the UAE and an extensive international network of over 45 countries.\r\n\r\nDaman, a pioneer in health care insurance, drives innovation through a combination of state-of-the-art technology and healthcare-related expertise offered by a highly skilled and knowledgeable workforce. Members benefit from added value through unique offerings such as the disease and case management programs as part of the acclaimed Health Support services. Daman also operates a 24/7 customer call center and has a medical services authorization team in direct contact with Daman’s network of healthcare providers. It also provides a diverse range of online services that are unmatched in the UAE.\r\n\r\nDaman has set high standards in the health insurance industry and has been awarded a number of internationally recognized awards and quality-focused certifications in a relatively short span of time. The company is ISO 9001 certified for Quality Management Systems.\r\n\r\n<b><b>About One Drop</b></b>\r\nOne Drop (Informed Data Systems Inc.) is a digital health company harnessing the power of mobile computing and data science to empower people with diabetes to live healthier lives. The One Drop | Mobile solution is available for free worldwide on <a href=\"http://apple.co/1IWTvGk\">iOS</a> and <a href=\"http://bit.ly/2gLzk6y\">Android</a>. One Drop | Premium is a consumer subscription service available for purchase in-app and at online at <a href=\"/\">http://onedrop.today</a>. One Drop | Professional is an enterprise solution for insurers, healthcare provider networks, and self-insured employers to dramatically lower the cost of caring for people with diabetes. For more information, visit <a href=\"/professional\">http://onedrop.today/professional</a>.\r\n\r\n<b>Press Contact</b>\r\njust@onedrop.today",
		"blog_id": 28891840608,
		"author": "Rachel Sanchez-Madhur",
		"user_id": 104154768,
		"published_at": "2016-12-15T00:00:15-05:00",
		"updated_at": "2022-03-28T22:18:24-04:00",
		"summary_html": "",
		"template_suffix": "press-release",
		"handle": "health-insurance-company-partnership",
		"tags": "Press Releases",
		"admin_graphql_api_id": "gid://shopify/Article/28912025696",
		"image": {
			"created_at": "2018-12-18T13:04:00-05:00",
			"alt": "Daman + One Drop | Professional",
			"width": 1200,
			"height": 630,
			"src": "https://cdn.shopify.com/s/files/1/1488/7742/articles/oneDropProfessional-featureImage.png?v=1545156241"
		}
	}
]